DBCoverflow/app/controllers/answers_controller.rb

  def create
    p params
    @answer = Answer.create(content: params[:answer][:content], user_id: session[:user_id], question_id: params[:question_id])
---
INSERT INTO "answers" ("content", "created_at", "question_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "asdf"], ["created_at", "2014-06-25 23:21:02.684070"], ["question_id", 6], ["updated_at", "2014-06-25 23:21:02.684070"], ["user_id", 1]]