DBCoverflow/app/controllers/questions_controller.rb

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "answers".* FROM "answers"  WHERE "answers"."question_id" = $1  [["question_id", 1]]
---
  def show
    @question = Question.find(params[:id])
    @comments = @question.comments.all
    @answers = @question.answers.all

INSERT INTO "questions" ("category_id", "content", "created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["category_id", 5], ["content", "post"], ["created_at", "2014-06-25 20:15:16.936917"], ["title", "title"], ["updated_at", "2014-06-25 20:15:16.936917"], ["user_id", 1]]
---
  def create
    @question = Question.new(question_params)
    @question.user_id = current_user.id
    if @question.save