DBCoverflow/app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

	def edit
		if current_user == User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

	def show
		if current_user == User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

	def update
		if current_user == User.find(params[:id])
			# look at the check for current user security shit
			current_user.update(user_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "updated_at" = $1, "username" = $2 WHERE "users"."id" = 1  [["updated_at", "2014-06-25 21:26:42.065315"], ["username", "kattykat"]]