app/views/answers/_answer.html.erb

INSERT INTO "answers" ("content", "created_at", "question_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "asdf"], ["created_at", "2014-06-25 23:21:02.684070"], ["question_id", 6], ["updated_at", "2014-06-25 23:21:02.684070"], ["user_id", 1]]
---
 <li><%=answer.content%> <%=answer.user.username%> <%=answer.created_at.in_time_zone("Central Time (US & Canada)").strftime("%m/%d/%Y %I:%M%p")%></li>