app/controllers/questions_controller.rb

  def index
    @questions = Question.order("created_at DESC").limit(12)
---
SELECT  "questions".* FROM "questions"   ORDER BY created_at DESC LIMIT 12